Revit 2027 API
ParameterTypeId.ViewerOptionVisibility Property
 "Visible In Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewerOptionVisibility { get; }
Public Shared ReadOnly Property ViewerOptionVisibility As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewerOptionVisibility {
	ForgeTypeId^ get ();
}
static member ViewerOptionVisibility : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace